//========================================
//
// ゴールの処理[obstacle.cpp]
// Author：小原立暉
//
//========================================
#include "goal.h"

//========================================
//名前空間
//========================================
namespace
{

}

//========================================
//コンストラクタ
//========================================
CGoal::CGoal() : CModel()
{//値をクリア
}

//========================================
//デストラクタ
//========================================
CGoal::~CGoal()
{
}

//========================================
// 初期化
//========================================
HRESULT CGoal::Init(void)
{
	if (FAILED(CModel::Init("data\\MODEL\\flag.x")))
	{ // 初期化に失敗した場合

		// 失敗を返す
		return E_FAIL;
	}

	return S_OK;
}

//========================================
// 終了
//========================================
void CGoal::Uninit(void)
{
	// 終了
	CModel::Uninit();
}

//========================================
// 更新
//========================================
void CGoal::Update(void)
{
	// 更新
	CModel::Update();
}

//========================================
// 描画
//========================================
void CGoal::Draw(void)
{
	// 描画
	CModel::Draw();
}

//========================================
// 生成処理
//========================================
CGoal* CGoal::Create()
{
	CGoal* pGoal = new CGoal;

	// 初期化処理
	pGoal->Init();

	// 位置・向き・種類設定
	pGoal->SetType(CModel::TYPE_NOT_HIERARCHY);
	pGoal->SetPosition(D3DXVECTOR3(50000.0f, 0.0f, 0.0f));
	pGoal->SetRot(D3DXVECTOR3(0.0f, 0.0f, 0.0f));

	// ポインタを返す
	return pGoal;
}
