//========================================
//
// 障害物(穴)の処理[obstacleHole.cpp]
// Author：小原立暉
//
//========================================
#include "obstacleHole.h"

//========================================
//名前空間
//========================================
namespace
{

}

//========================================
//コンストラクタ
//========================================
CObstacleHole::CObstacleHole() : CObstacle()
{//値をクリア
}

//========================================
//デストラクタ
//========================================
CObstacleHole::~CObstacleHole()
{
}

//========================================
// 初期化
//========================================
HRESULT CObstacleHole::Init(const EType type)
{
	if (FAILED(CObstacle::Init()))
	{ // 初期化処理に失敗した場合

		// 失敗を返す
		return E_FAIL;
	}

	return S_OK;
}

//========================================
// 終了
//========================================
void CObstacleHole::Uninit(void)
{
	// 終了
	CObstacle::Uninit();
}

//========================================
// 更新
//========================================
void CObstacleHole::Update(void)
{
	// 更新
	CObstacle::Update();
}

//========================================
// 描画
//========================================
void CObstacleHole::Draw(void)
{
	// 描画
	CObstacle::Draw();
}
