//============================================
//
//	聖書の処理 [bible.cpp]
//	Author:morikawa shunya
//
//============================================
#include "bible.h"

//====================================================================
// コンストラクタ
//====================================================================
CBible::CBible(int nPriority) : CItem(nPriority),
m_nIdxXModel	(0),			// Xモデル番号
m_nIdxTexture	(-1),			// テクスチャ番号
m_nStateCount	(0),			// 状態管理
m_fColorA		(0.0f),			// 不透明度
m_Scaling		(0.0f),			// 大きさ
m_bCollision	(false),		// 当たり判定
m_CollisionPos	(D3DXVECTOR3(0.0f, 0.0f, 0.0f)),	// 判定座標
m_pos			(D3DXVECTOR3(0.0f, 0.0f, 0.0f)),	// 位置
m_posOld		(D3DXVECTOR3(0.0f, 0.0f, 0.0f)),	// 過去の位置
m_move			(D3DXVECTOR3(0.0f, 0.0f, 0.0f)),	// 移動量
m_rot			(D3DXVECTOR3(0.0f, 0.0f, 0.0f))	// 向き
{
}

//====================================================================
// デストラクタ
//====================================================================
CBible::~CBible()
{

}

//====================================================================
// 生成
//====================================================================
CBible* CBible::Create(char* pModelName)
{
	// インスタンス生成
	CBible* pBible = new CBible;

	// 初期化
	pBible->Init(pModelName);

	return pBible;
}

//====================================================================
// 初期化
//====================================================================
HRESULT CBible::Init(char* pModelName)
{
	// 継承クラスの初期化
	CItem::Init(pModelName);

	return S_OK;
}

//====================================================================
// 終了
//====================================================================
void CBible::Uninit(void)
{
	CItem::Uninit();
}

//====================================================================
// 更新
//====================================================================
void CBible::Update(void)
{
	CItem::Update();

	// 当たり判定
	CItem::CollisionPlayer();
}

//====================================================================
// 描画
//====================================================================
void CBible::Draw(void)
{
	CItem::Draw();
}
