//============================================
//
//	チュートリアルのプレイヤー [TutorialPlayer.cpp]
//	Author:sakamoto kai
//
//============================================
#include "GamePlayer.h"
#include "object.h"
#include "manager.h"
#include "MyEffekseer.h"

//===========================================
// 定数定義
//===========================================
namespace
{

}

//===========================================
// 静的メンバ変数宣言
//===========================================
CListManager<CGamePlayer>* CGamePlayer::m_pList = nullptr; // オブジェクトリスト

//====================================================================
//コンストラクタ
//====================================================================
CGamePlayer::CGamePlayer(int nPriority) : CPlayer(nPriority)
{

}

//====================================================================
//デストラクタ
//====================================================================
CGamePlayer::~CGamePlayer()
{

}

//====================================================================
//生成処理
//====================================================================
CGamePlayer* CGamePlayer::Create(int PlayNumber)
{
	CGamePlayer* pPlayer = new CGamePlayer();

	// メモリの確保に失敗した場合nullを返す
	if (pPlayer == nullptr) { assert(false); return nullptr; }

	// 初期化処理に失敗した場合nullを返す
	if (FAILED(pPlayer->Init(PlayNumber)))
	{
		assert(false);
		delete pPlayer;
		return nullptr;
	}

	return pPlayer;
}

//====================================================================
//初期化処理
//====================================================================
HRESULT CGamePlayer::Init(int PlayNumber)
{
	CPlayer::Init(PlayNumber);

	return S_OK;
}

//====================================================================
//終了処理
//====================================================================
void CGamePlayer::Uninit(void)
{
	// リストから自身のオブジェクトを削除
	m_pList->DelList(m_iterator);

	if (m_pList->GetNumAll() == 0)
	{ // オブジェクトが一つもない場合

		// リストマネージャーの破棄
		m_pList->Release(m_pList);
	}

	// キャラクタークラスの終了（継承）
	CPlayer::Uninit();
}

//====================================================================
//更新処理
//====================================================================
void CGamePlayer::Update(void)
{
	CPlayer::Update();
}

//====================================================================
//描画処理
//====================================================================
void CGamePlayer::Draw(void)
{
	// キャラクタークラスの描画（継承）
	CPlayer::Draw();
}

//==========================================
//  リストの取得
//==========================================
CListManager<CGamePlayer>* CGamePlayer::GetList(void)
{
	return m_pList;
}
