//============================================
//
//	入力管理 [inputManager.h]
//	Author: Kai Takada
//
//============================================

#include "inputManager.h"

//定数定義
namespace
{

}

//====================================================================
//コンストラクタ
//====================================================================
CInputManager::CInputManager()
{

}

//====================================================================
//デストラクタ
//====================================================================
CInputManager::~CInputManager()
{

}

//====================================================================
//生成処理
//====================================================================
CInputManager* CInputManager::Create(void)
{
	CInputManager* pInstance = NULL;

	if (pInstance == NULL)
	{
		//オブジェクト2Dの生成
		pInstance = new CInputManager();
	}

	//オブジェクトの初期化処理
	if (FAILED(pInstance->Init()))
	{//初期化処理が失敗した場合
		return NULL;
	}

	return pInstance;
}

//====================================================================
//初期化処理
//====================================================================
HRESULT CInputManager::Init(void)
{
	return S_OK;
}

//====================================================================
//終了処理
//====================================================================
void CInputManager::Uninit(void)
{

}