//============================================
//
//	レールマネージャー [RailManager.cpp]
//	Author:Satone Shion
//
//============================================
#include "RailManager.h"
#include "renderer.h"
#include "manager.h"
#include "texture.h"
#include "MapSystem.h"

//==========================================
//  定数定義
//==========================================
namespace
{
	const D3DXVECTOR3 SAMPLE_SIZE = D3DXVECTOR3(20.0f, 20.0f, 20.0f);		//当たり判定
	const char* FILE_PASS = "data\\MODEL\\fireball.x"; // モデルパス
}

//====================================================================
//静的メンバ変数宣言
//====================================================================
CListManager<CRailManager>* CRailManager::m_pList = nullptr;	// オブジェクトリスト
std::vector<CMapSystem::GRID> CRailManager::m_GridPos = {};		// レールの位置を保持

//====================================================================
//コンストラクタ
//====================================================================
CRailManager::CRailManager()
{
	
}

//====================================================================
//デストラクタ
//====================================================================
CRailManager::~CRailManager()
{

}

//====================================================================
//初期化処理
//====================================================================
HRESULT CRailManager::Init(CMapSystem::GRID grid)
{
	// レールの位置を保持
	m_GridPos.push_back(grid);

	return S_OK;
}

//====================================================================
//終了処理
//====================================================================
void CRailManager::Uninit(void)
{
	
}

//====================================================================
//更新処理
//====================================================================
void CRailManager::Update(void)
{
	
}

//====================================================================
//描画処理
//====================================================================
void CRailManager::Draw(void)
{

}
